app/views/comments/_comment.html.erb

INSERT INTO "comments" ("title", "body", "user_id", "created_at", "updated_at", "recipe_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test a"], ["body", "test a"], ["user_id", 1], ["created_at", "2019-03-27 01:59:44.258428"], ["updated_at", "2019-03-27 01:59:44.258428"], ["recipe_id", 2]]
---
		<p class="comment_body"><%= comment.body %></p>
		<small class="comment_time"><%= time_ago_in_words(comment.created_at) %> ago, by <strong><%= comment.user.email %></strong></small>