app/views/recipes/_directions_show.html.erb

    <h2>Directions </h2>
      <% @recipe.directions.each.with_index(1) do |direction, i| %>
---
SELECT "directions".* FROM "directions" WHERE "directions"."recipe_id" = $1  [["recipe_id", 2]]