app/views/recipes/_form.html.erb

SELECT "categories".* FROM "categories"
---
            <div class="collection-check-box">
              <%= f.collection_check_boxes(:category_ids, Category.all, :id, :name, checked: @recipe.categories.map(&:id)) do |c| %>