app/views/recipes/_ingredients_show.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."recipe_id" = $1  [["recipe_id", 2]]
---
      <% end %>
      <% @recipe.ingredients.each.with_index(1) do |ingredient, i| %>