app/views/recipes/_recipe_info_show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "recipe_categories" ON "categories"."id" = "recipe_categories"."category_id" WHERE "recipe_categories"."recipe_id" = $1  [["recipe_id", 2]]
---
    <p>Submitted by <%= link_to @recipe.user.email, root_url %></p>
    <% @recipe.categories.each do |cat| %>