app/views/recipes/_render_comment_fields.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 2]]
SELECT COUNT(*) FROM "comments" WHERE "comments"."recipe_id" = $1  [["recipe_id", 2]]
---
	<div class="col-md-8 offset-md-2">
		<h3><%= @recipe.comments.count %> Comments</h3>