app/controllers/comments_controller.rb

  def create
		@recipe = Recipe.find(params[:recipe_id])
		@comment = @recipe.comments.build(comment_params)
    @comment.user = current_user
    @comment.save
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
INSERT INTO "comments" ("title", "body", "user_id", "created_at", "updated_at", "recipe_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test a"], ["body", "test a"], ["user_id", 1], ["created_at", "2019-03-27 01:59:44.258428"], ["updated_at", "2019-03-27 01:59:44.258428"], ["recipe_id", 2]]

	def destroy
		@recipe = Recipe.find(params[:recipe_id])
		@comment = @recipe.comments.find(params[:id])
    if @comment.user == current_user
		  @comment.destroy
---
SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT  "comments".* FROM "comments" WHERE "comments"."recipe_id" = $1 AND "comments"."id" = $2 LIMIT $3  [["recipe_id", 2], ["id", 6], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 6]]