app/controllers/recipes_controller.rb

SELECT "recipes".* FROM "recipes" ORDER BY created_at desc
---
  def index
    @search = Recipe.search(params[:q])
    @recipes = @search.result.order_by_created_at_desc

INSERT INTO "recipes" ("title", "description", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Recipe 1"], ["description", "Recipe 1 description"], ["user_id", 1], ["created_at", "2019-03-27 01:42:19.819374"], ["updated_at", "2019-03-27 01:42:19.819374"]]
---
  def create
    if current_user
      @recipe = current_user.recipes.build(recipe_params)
  		if @recipe.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_user!
    if current_user != Recipe.find(params[:id]).user

SELECT  "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_params
      @recipe = Recipe.find(params[:id])